print('Задача 8. НОД')

#Напишите функцию, вычисляющую наибольший общий делитель двух чисел